"""
19. Знайти корені квадратного рівняння A · x2
+ B · x + C = 0, заданого своїми коефіцієнтами A, B, C
(A>0), якщо відомо, що дискримінант рівняння позитивний. Вивести спочатку менший, а потім
більший із знайдених коренів. Коріння квадратного рівняння знаходяться за формулою x1, 2 =
(−B ± (D)1/2)/(2·A), де D - дискримінант, що дорівнює B
2
− 4·A·C.
"""


def main():
    print('Введіть значення параметрів A,B,C:')
    A = float(input('A = '))
    B = float(input('B = '))
    C = float(input('C = '))

    if A <= 0:
        print('Error')
    else:
        D = (B ** 2 - 4 * A * C) ** (1/2)
        if D > 0:
            x1 = (-B + D) / (2 * A)
            x2 = (-B - D) / (2 * A)
            if x1 >= x2:
                print(x1, ' ', x2)
            else:
                print(x2, ' ', x1)
        else:
            print('Error')


if __name__ == '__main__':
    main()