"""
6. Дано ціле число в діапазоні 1-7. Вивести рядок - назва дня тижня, що відповідає даному числу (1 -
«понеділок», 2 - «вівторок» і т. д.).
"""


def main(day):
    day_s = {
        1: "Понеділок",
        2: "Вівторок",
        3: "Середа",
        4: "Четвер",
        5: "П'ятниця",
        6: "Субота",
        7: "Неділя"
    }
    week_day = day_s.get(day, 'Такого значення не існує')
    return week_day


print("Введіть число в діапазоні 1-7:")
result = int(input('-'))
if __name__ == "__main__":
    print(main(result))
input()