"""
14. Обчислити довжину окружності, площу кола та об'єм кулі одного і того ж заданого радіусу.
"""


def check(R):
    if R > 0:
        Sp(R)
    else:
        print('Error')


def Sp(R):
    print(f'Довжина окружності з радіусом {R} дорівнює ', 2 * 3.14 * R)
    print(f'Площа кола з радіусом {R} дорівнює ', 3.14 * (R ** 2))
    print(f"Об'єм кулі з радіусом {R} дорівнює", 4 / 3 * 3.14 * (R**3))


def main():
    R = float(input('Enter radius: '))
    check(R)


if __name__ == '__main__':
    main()