"""
16. Дано додатні числа A і B (A> B). На відрізку довжиною A розміщено максимально можлива
кількість відрізків довжиною B (без накладання). Не використовуючи операції множення і ділення,
знайти довжину незайнятої частини відрізка A.
"""


def main(def_A, def_B):
    if def_A > def_B > 0:
        while def_A >= def_B:
            def_A -= def_B
        return f'Незайнята ділянка відрізка А дорівнює {def_A}'
    else:
        return 'Сталася помилка'


print('Введіть додатні числа А і В (А > B)')
A = float(input('A = '))
B = float(input('B = '))
if __name__ == '__main__':
    result = main(A, B)
    print(result)
