"""
17. Швидкість першого автомобіля V1 км/год, другого - V2 км/год, відстань між ними S км.
Визначити відстань між ними через T годин, якщо автомобілі спочатку рухаються назустріч один
одному. Дана відстань рівна модулю різниці початкової відстані і загального шляху, пройденого
автомобілями; загальний шлях = час · сумарна швидкість.
"""


def check(V1, V2, S, T):                            #функція, що перевіряє правильність вводу чисел
    if V1 < 0 or V2 < 0 or S < 0 or T < 0:
        print("False")
    else:
        calc(V1, V2, S, T)


def calc(V1, V2, S, T):                              #функція розрахунку модуля відстані між фвтомобілями
    S = abs(V1*T + V2*T - S)
    print('S =', S)


def main():
    v1 = int(input("V1 = "))

    v2 = int(input("V2 = "))

    s = int(input("S = "))

    t = int(input("t = "))

    check(v1, v2, s, t)


if __name__ == '__main__':
    main()