"""
10. Даний розмір файла в байтах. Використовуючи операцію ділення без залишку, знайти кількість
повних кілобайтів, які займає даний файл (1 кілобайт = 1024 байта).
"""


def size(B):                                    #функція обрахунку переведення файлу з байтів в кілобайтів
    KB = int(B / 1024)
    print('Size of KB = ', KB)


def main():
    Size = int(input('Enter size of byte: '))       #вводимо дані та викликаємо функцію size
    size(Size)


if __name__ == '__main__':
    main()